---
kind: property
id: P:Autodesk.Revit.DB.Architecture.SiteSubRegion.HostId
source: html/3f84194d-97c6-7b97-fd69-14d4060bd621.htm
---
# Autodesk.Revit.DB.Architecture.SiteSubRegion.HostId Property

The element id of the topography surface hosting this SiteSubRegion.

## Syntax (C#)
```csharp
public ElementId HostId { get; }
```